function pow(x, y) {
    // Перевіряємо, чи x або y є null, NaN або undefined
    if (x == null || isNaN(x) || y == null || isNaN(y)) {
        return `Введені значення повинні бути числами`;
    }

    let result = 1; // Ініціалізуємо змінну для зберігання результату піднесення числа до степеня
    // Виконуємо цикл, який перемножує число x y (число яке отримуємо) разів.
    for (let i = 0; i < y; i++) {
        result *= x;
    }
    return `Число ${x} в степені ${y} = ${result}`; // Повертаємо рядок з результатом піднесення числа до степеня
}

// Запитуємо користувача про число і значення для піднесення до степеня
let num1 = parseInt(prompt(`Введи число, яке хочеш піднести до степеня:`));
let num2 = parseInt(prompt(`Укажи степінь, до якої піднести перше число:`));

// Виводимо результат в консоль
console.log(pow(num1, num2));
